Repository: RuslanAl1mov/FeedbackSIUT
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Feedback on Final Exam, Process, Performance and Evaluation
ru: Обратная связь по итогам экзамена, процесса, выполнения и оценки
uz: Yakuniy imtihonlar, jarayon, mahsuldorlik va baholash bo'yicha fikr-mulohazalar

source: Feedback language
ru: Язык обратной связи
uz: Qayta aloqa tili

source: Language:
ru: Язык:
uz: Til:

source: Fill the Form
ru: Заполните форму
uz: Formani to'ldiring

source: Full name
ru: Полное имя

source: Enter full name
ru: Введите полное имя

source: School
ru: Школа
uz: Fakultet

source: Department
ru: Отделение
uz: Yo'nalish

source: First select School
ru: Сначала выберите школу
uz: Avval Fakultetni tanlang

source: Subject
ru: Предмет
uz: Fan

source: First select Department
ru: Сначала выберите отделение

source: Answer the Questions
ru: Ответьте на вопросы
uz: Savollarga javob bering

source: Dear Student! Your answers will contribute to improving the content of subsequent modules of the course, in order to increase its effectiveness.
ru: Уважаемый студент! Ваши ответы помогут улучшить содержание последующих модулей курса с целью повышения его эффективности.
uz: Hurmatli talaba! Sizning javoblaringiz fanning keyingi modullari mazmunini takomillashtirishga, uning samaradorligini oshirishga yordam beradi.

source: Please rate in points (lowest rating is 1, highest rating is 5)
ru: Пожалуйста, поставьте оценку в баллах (от 1 до 5)
uz: Baholang (eng past ball - 1, eng yuqori ball - 5)

source: Question
ru: Вопрос
uz: Savol

source: How well did your expectations from the course meet?
ru: Насколько хорошо ваши ожидания от курса сбылись?
uz: Kursdan umidlaringiz qanchalik oqlandi?

source: The effectiveness of the chosen form of course delivery
ru: Эффективность выбранной формы проведения курса
uz: Fanni o'tish uchun tanlangan shaklning samaradorligi

source: Organization of the educational process (content, conditions, etc.)
ru: Организация учебного процесса (содержание, условия и т.д.)
uz: O'quv jarayonini tashkil etish (tarkib, sharoitlar va boshqalar).

source: Did the final exam adequately cover the course material that was taught?
ru: Адекватно ли финальный экзамен охватывал учебный материал курса?

source: Strongly Agree
ru: Полностью согласен

source: Agree
ru: Согласен

source: Neither agree nor disagree
ru: Ни согласен, ни не согласен

source: Strongly Disagree
ru: Полностью не согласен

source: Were the instructions clear and easy to understand?
ru: Инструкции были ясными и легкими для понимания?

source: Did you feel the final exam was a fair and accurate assessment of your learning in the course?
ru: Считаете ли вы, что финальный экзамен честно и точно оценил ваши знания в ходе курса?

source: YOUR COMMENTS (Very important for us)
ru: ВАШИ КОММЕНТАРИИ (Очень важно для нас)
uz: Izohlaringiz (biz uchun bu juda muhim)

source: Comments
ru: Комментарии
uz: Izohlar

source: What new things did you learn during this course?
ru: Какие новые вещи вы узнали в ходе этого курса?
uz: Ushbu kurs davomida qanday yangi narsalarni o'rgandingiz?

source: What did you like most about the course and why?
ru: Что вам больше всего понравилось в курсе и почему?
uz: Kursda sizga ko'proq nima yoqdi va nega?

source: If you have additional comments, wishes to the administration, professors of the course, please write them.
ru: Если у вас есть дополнительные комментарии, пожелания к администрации, преподавателям курса, напишите их, пожалуйста.
uz: Kurs rahbariyatiga, professor-o'qituvchilariga qo'shimcha fikr-mulohazalaringiz, tilaklaringiz bo'lsa, yozib qoldiring.

source: Submit form
ru: Отправить форму
uz: Yuborish

source: Questionnaire based on the results of the academic subject
uz: Oâ€˜quv kurslaridan olingan natijalar asosida

source: Teacher
uz: O'qituvchi

source: What would you like to change in the curriculum?.
uz: O'quv dasturida nimani o'zgartirishni xohlaysiz?

source: What else could be included in the course program?
uz: Kurs dasturiga yana nimalar kiritilishi mumkin?

source: What OTHER subject would you like to continue your studies in?
uz: Yana qaysi fan bo'yicha o'qishni davom ettirmoqchisiz?
